raters-of-the-lost-arc/app/controllers/films_controller.rb

  def index
    @films = Film.all
---
SELECT "films".* FROM "films"

  def show
    @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT 1  [["id", 0]]