raters-of-the-lost-arc/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "abc"], ["email", "abc@def.com"], ["created_at", "2016-08-24 19:46:23.892293"], ["updated_at", "2016-08-24 19:46:23.892293"]]